<?php

return [
    'user_cancel_request' => 'لقد اختار المستخدم إلغاء طلب التجارة هذا',
    'user_cancel_order' => 'لقد اختار المستخدم إلغاء هذا الطلب',
    'trader' => [
        'bursa' => [
            'hold_status' => 'طلب التداول معلق بسبب الموعد النهائي لسوق المتداول الدولي (بورصة ماليزيا) حتى :TIME بتوقيت المملكة العربية السعودية.',
        ],
        'lynk' => [
            'cancelled_status' => 'اختار المستخدم إلغاء طلب التجارة هذا.',
            'no_commodity_available' => 'لا يوجد سلع كافيه داخل السوق المحلي',
            'internal_technical_error' => 'يوجد خطا ما',
            'expired_contract_time' => 'انتهى الوقت المحدد لتوقيع العقد بعد :TIME ساعة.',
            'expired_confirmation_time_limit' => 'انتهى الوقت المحدد لتوقيع العقد بعد :TIME ساعة.',
            'steps' => [
                'contract_signed' => [
                    'v1' => [
                        'sell' => 'تم توقيع العقد - بيع للعميل مؤكد بواسطة المستخدم.',
                        'deliver' => 'تم توقيع العقد - تم تسليم الطلب للعميل من قبل المستخدم.',
                    ],
                    'v2' => [
                        'proceed' => 'تم توقيع العقد بواسطة المستخدم.',
                    ],
                ],
                'client_wakala' => [
                    'v2' => [
                        'sell' => 'تم توقيع وكالة العميل - تم تأكيد طلب البيع من قبل المستخدم.',
                        'deliver' => 'تم توقيع وكالة العميل - تم تأكيد طلب التوصيل للعميل من قبل المستخدم. يُرجى التواصل مع مسؤول LYNK لتأكيد عملية التسليم واللوجستيات.',
                    ],
                ],
                'customer_delivery_confirmation' => [
                    'delivery_not_applicable' => 'تم توقيع العقد - تم تأكيد البيع. التسليم غير متاح.',
                    'pending' => 'تأكيد تسليم العميل - التسليم للعميل في انتظار تأكيد العميل. يُرجى التواصل مع العميل لتأكيد التسليم أو تجاهله والبيع.',
                    'IgnoreAndSell' => 'تأكيد تسليم العميل - إلغاء التسليم والبيع للعميل الذي تم تأكيده من قِبل المستخدم',
                    'DeliveryConfirmed' => 'تأكيد تسليم العميل - التسليم للعميل المؤكد من قِبل المستخدم. يُرجى التواصل مع مسؤول LYNK لتأكيد عملية التسليم واللوجستيات.',
                ],
            ],
        ],
    ],
];
