<?php

return [
    'user_cancel_request' => 'لقد اختار المستخدم إلغاء طلب التجارة هذا',
    'user_cancel_order' => 'لقد اختار المستخدم إلغاء هذا الطلب',
    'trader' => [
        'lynk' => [
            'steps' => [
                'contract_signed' => [
                    'sell' => 'تم توقيع العقد - بيع للعميل مؤكد بواسطة المستخدم.',
                    'deliver' => 'تم توقيع العقد - تم تسليم الطلب للعميل من قبل المستخدم.',
                ],
                'customer_delivery_confirmation'  => [
                    'pending' => 'تأكيد تسليم العميل - التسليم للعميل في انتظار تأكيد العميل. يُرجى التواصل مع العميل لتأكيد التسليم أو تجاهله والبيع.',
                    'IgnoreAndSell' => 'تأكيد تسليم العميل - إلغاء التسليم والبيع للعميل الذي تم تأكيده من قِبل المستخدم',
                    'DeliveryConfirmed' => 'تأكيد تسليم العميل - التسليم للعميل المؤكد من قِبل المستخدم. يُرجى التواصل مع مسؤول LYNK لتأكيد عملية التسليم واللوجستيات.',
                ],
            ],
        ],
    ],
];
